c5/src/Catalogs/Warehouses/Warehouses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Warehouses</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Companies</owners>
  <attributes>
    <name>Address</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>Class</name>
    <type>
      <types>EnumRef.WarehouseTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Contact</name>
    <type>
      <types>CatalogRef.Contacts</types>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.Departments</types>
    </type>
  </attributes>
  <attributes>
    <name>Prices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>Production</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
</mdclass:Catalog>

c5/src/Enums/WarehouseTypes/WarehouseTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>WarehouseTypes</name>
  <enumValues>
    <name>Stock</name>
  </enumValues>
  <enumValues>
    <name>TradePoint</name>
  </enumValues>
  <enumValues>
    <name>PickPack</name>
  </enumValues>
  <enumValues>
    <name>Salesman</name>
  </enumValues>
  <enumValues>
    <name>Car</name>
  </enumValues>
  <enumValues>
    <name>Shelves</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
</mdclass:Enum>

c5/src/Catalogs/Warehouses/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	if ( Object.Ref.IsEmpty () ) then
		fillNew ();
	endif;
	StandardButtons.Arrange ( ThisObject );
	readAppearance ();
	Appearance.Apply ( ThisObject );
		
EndProcedure

&AtServer
Procedure fillNew ()
	
	if ( not Parameters.CopyingValue.IsEmpty () ) then
		return;
	endif;
	if ( Object.Owner.IsEmpty () ) then
		Object.Owner = Logins.Settings ( "Company" ).Company;
	endif; 
	
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|Address Contact enable filled ( Object.Ref );
	|Write show empty ( Object.Ref );
	|Responsible show inlist ( Object.Class, Enum.WarehouseTypes.Salesman, Enum.WarehouseTypes.Car );
	|Department show Object.Production
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure AfterWriteAtServer ( CurrentObject, WriteParameters )
	
	Appearance.Apply ( ThisObject );

EndProcedure

// *****************************************
// *********** Group Main

&AtClient
Procedure ClassOnChange ( Item )
	
	applyClass ();
	
EndProcedure

&AtServer
Procedure applyClass ()
	
	class = Object.Class;
	if ( class <> Enums.WarehouseTypes.Salesman
		and class <> Enums.WarehouseTypes.Car ) then
		Object.Responsible = undefined;
	endif; 
	Appearance.Apply ( ThisObject, "Object.Class" );
	
EndProcedure 

&AtClient
Procedure ResponsibleOnChange ( Item )
	
	setDescription ();
	
EndProcedure

&AtClient
Procedure setDescription ()
	
	Object.Description = Object.Responsible;
	
EndProcedure 

&AtClient
Procedure ProductionOnChange ( Item )
	
	applyProduction ();
	
EndProcedure

&AtClient
Procedure applyProduction ()
	
	if ( not Object.Production ) then
		Object.Department = undefined;
	endif;
	Appearance.Apply ( ThisObject, "Object.Production" );
	
EndProcedure
